
&НаКлиенте
Процедура КОМПИЛИРОВАТЬ(Команда)

		Если РеквизитЧисло = "1" Тогда // Подсчёт гласных
		счет = 0;
		Гласные = СтрРазделить("а,у,о,ы,и,э,я,ю,е,А,У,О,Ы,И,Э,Я,Ю,Е", ",");
		Для каждого Элемент Из Гласные Цикл
  			Если СтрЧислоВхождений(ВВОД, Элемент) > 0 Тогда
   			 	счет = счет + 1;
  			КонецЕсли;
		КонецЦикла;
		ВЫВОД = счет;
		
	
	ИначеЕсли РеквизитЧисло = "2" Тогда   
		
		предложение = СтрРазделить(ВВОД, " ");
		число = 0;
		Для каждого Элемент Из предложение Цикл
			Если Элемент > " " Тогда
		    	число = число + 1;
		  	конецесли;
		КонецЦикла;  
		ВЫВОД = число; 
		
	КонецЕсли;   
	
КонецПроцедуры
